module.exports = {
    name: "panel",
    type: "interaction",
    prototype: "slash",
    code: 
    `
        $interactionReply[{newEmbed:{description:**<:true:1339394187283529802> Ticket panel sent successfully**}{color:#7532bb}};everyone;true]

        $sendMessage[{newEmbed:
            {title:**<:ticket:1339396921147654215> | تذاكر الدعم الفني لسيرفر تجمع العرب**}
            {color:#7532bb}
            {description:
                مرحبًا بك في قسم **الدعم الفني**!   
                إذا كنت بحاجة إلى مساعدة أو واجهت مشكلة، نحن هنا لخدمتك. لدينا قسمين مخصصين لضمان توفير الدعم المناسب لك:  

                ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ

                *<:ticket:1339396921147654215> **قسم الدعم الفني***
                <:point:1339394475918626826> **للإستفسار عن أي مشكلة أو سؤال يخص السيرفر أو الماب، تفضل بفتح تذكرة.**   
                يتم الرد على جميع الاستفسارات في أسرع وقت ممكن.  



                ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ

                *<:bug:1339398243251130402> **قسم الإبلاغ عن ثغرة في الماب***
                <:point:1339394475918626826> **إذا اكتشفت ثغرة أو خللًا في الماب، يمكنك الإبلاغ عنها هنا**  
                سيتم التعامل مع جميع البلاغات بأقصى سرعة لضمان تجربة لعب سلسة وآمنة للجميع.  



                ـــــــــــــــــــــــــــــــــــــــ

                <:info:1339398516786729084> **ملاحظة:**  
                <:square:1339398653223108682> تأكد من تقديم التفاصيل الكاملة عند فتح التذكرة، بما في ذلك وصف المشكلة أو الثغرة، حتى نتمكن من مساعدتك بشكل أسرع.  
                <:heart:1339399246251687967> **شكراً لتعاونك معنا لضمان تقديم أفضل تجربة في سيرفر تجمع العرب!**
            }
            {image:https://media.discordapp.net/attachments/1334556186950897716/1334556258531020843/line12.png}
            {thumbnail:https://media.discordapp.net/attachments/1334556186950897716/1334556501234155621/Logo.png}
        }{actionRow:{button:الدعم الفني:secondary:support:false:<:ticket:1339396921147654215>}{button:الإبلاغ عن ثغرة في الماب:secondary:bug:false:<:bug:1339398243251130402>}}]

        $suppressErrors[{newEmbed:{description:**<:alert2:1339595951005765692> Something went wrong!**}{color:#ff0000}}{interaction}{ephemeral}]

    `
};